&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	СправчникОбъект = РеквизитФормыВЗначение("Объект");
	СправчникОбъект.ФорматироватьНаименование();
	ЗначениеВРеквизитФормы(СправчникОбъект,"Объект");
	
	СправчникОбъект = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.Контрагенты"));
	СправчникОбъект.ФорматироватьНаименование();
	ЗначениеВДанныеФормы(СправчникОбъект,Объект);
	
КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьВидимостьПолей()
//	
//	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
//		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
//		Элементы.КПП.Видимость = Истина;
//		Элементы.ОГРН.Видимость = Истина;
//	Иначе
//		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
//		Элементы.КПП.Видимость = Ложь;
//		Элементы.ОГРН.Видимость = Ложь;
//	КонецЕсли;     
//	
//КонецПроцедуры // ()

&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	УстановитьВидимостьПолей();
//КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей()
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
		Элементы.КПП.Видимость = Истина;
		Элементы.ОГРН.Видимость = Истина;
	Иначе
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
		Элементы.КПП.Видимость = Ложь;
		Элементы.ОГРН.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая()  Тогда
		Ответ = Вопрос("Создать основной договор?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ =КодВозвратаДиалога.Да Тогда
			ПараметрыЗаписи.Вставить("Ответ", "Да");
			Сообщить("Договор создан!");
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			ПараметрыЗаписи.Вставить("Ответ", "Нет");
			Сообщить("Контрагент записан, договор не создан!");
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
			Сообщить("Сохранение не выполнено");
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая()  Тогда
		Если ПараметрыЗаписи.Ответ = "Да" Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьДоговор", Истина);
		ИначеЕсли ПараметрыЗаписи.Ответ = "Нет" Тогда 
			ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьДоговор", Ложь);
		КонецЕсли;
	Иначе
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьДоговор", Ложь);	
	КонецЕсли;
	
КонецПроцедуры








